notes/data_preparation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Data for Public Employement Analysis</title>
<!-- 2016-02-15 Mon 04:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="David Pham" />
</head>
<body>
<div id="content">
<h1 class="title">Data for Public Employement Analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. New variable in the data set</a></li>
<li><a href="#sec-2">2. Unclear points</a></li>
<li><a href="#sec-3">3. Data</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> New variable in the data set</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>GDP per capita (log): GDPVD (PPP, in USD) over population for population in
log. Formula: \(log(GDPVD/POP)\), where \(POP\) is interpolated from annual
data (data comes from th OECD).
</li>
<li>Government revenue (defined as percent of GDP) . Formula: \(100\cdot YRG/GDPVD\),
with \(YRG\) interpolated from annual data.
</li>
<li>Net lending NLG as % of GDP (interpolated from annual data). Formula:
\(100\cdot NLG/GDPVD\), with \(NLG\) interpolated from annual data.
</li>
<li>Time Trend.
</li>
<li>GAP (gdp output gap). Formula: \(100 \cdot (GDPV/GDPVTR-1)\).
</li>
<li>GAPLFP (deviation from trend of labor force).
</li>
<li>Inequality SWIID data set: please note that the mean of the imputation is
considered (and not the 100 imputations from the data set). CAUTION: data
should be used only up to 2010 as there are no further data for Canada, Japan
and Ireland (please check the graphics).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Unclear points</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>I did not compute GDPVDTR (Potential of total economy, at 2010 PPP,
USD. Formula: \(GDPVD/GDPV \cdot GDPDTR\). as I am not sure how we could use
it. The output gap variable is already in %.
</li>
<li>Market outcome vs Net outcome: In my notes, I wrote that we should use
the difference of these two variables but I could not remember where I could
find the data.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Data</h2>
<div class="outline-text-2" id="text-3">
<p>
The table provides a short description of the most relevant variable for the
analysis. There are two version, one with all the variable from the oecd
economic outlook data set and one with only the required variable for the
regressions.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Most relevant variables of the design matrix for public employment analysis. Note that all column names are written with underscore letters.</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Variable Name</th>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">Source (if not OECD)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">TIME</td>
<td class="left">Time as numeric value (e.g. 2000-Q3 is 2000.5)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">country</td>
<td class="left">ISO formatted country (e.g. France is FRA)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">egr</td>
<td class="left">Employment Rate as a percentage of labor force</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">execrlc</td>
<td class="left">Executive government political direction</td>
<td class="left">World Bank</td>
</tr>

<tr>
<td class="left">fiscal_transparency_interpolated</td>
<td class="left">IMF GFS fiscal transparency score</td>
<td class="left">IMF</td>
</tr>

<tr>
<td class="left">gap_interpolated</td>
<td class="left">Output GAP as \(100 \cdot (GDPV/GDPVTR-1)\)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">gaplfp_interpolated</td>
<td class="left">Deviation from labor force trend</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">gdp_per_capita_log</td>
<td class="left">Log of gdp_per_capita, \(log(GDPVD)-LPOP\_INTERPOLATED-6log(1)\)</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">gdpvd</td>
<td class="left">GDP, 2010 PPP in USD.</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">gdpv_yoy_annpct</td>
<td class="left">GDPV Growth, YoY in %</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">gini_market_interpolated</td>
<td class="left">Gini coefficient before tax and subsidies</td>
<td class="left">SWIID</td>
</tr>

<tr>
<td class="left">gini_net_interpolated</td>
<td class="left">Gini coefficient after tax and subsidies</td>
<td class="left">SWIID</td>
</tr>

<tr>
<td class="left">gini_red_abs</td>
<td class="left">Reduction of gini coefficient, absolute</td>
<td class="left">SWIID</td>
</tr>

<tr>
<td class="left">gini_red_abs</td>
<td class="left">Reduction of gini coefficient, relative in %</td>
<td class="left">SWIID</td>
</tr>

<tr>
<td class="left">government_revenue</td>
<td class="left">Government revenue in % of GDPV</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">govfrac</td>
<td class="left">Government fractionalization (defined by the WB)</td>
<td class="left">World Bank</td>
</tr>

<tr>
<td class="left">is_election_date</td>
<td class="left">1 if an election is organized during the quarter</td>
<td class="left">World Bank</td>
</tr>

<tr>
<td class="left">lpop_interpolated</td>
<td class="left">Log of population.</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">nlg_to_gdpv</td>
<td class="left">Net lending in % of gdpv</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">pop_interpolated</td>
<td class="left">Population in million of persons.</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">QUARTER</td>
<td class="left">Quarter of the observation</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">unr</td>
<td class="left">Unemployment rate</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">YEAR</td>
<td class="left">Year of the observation</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">yrcurnt</td>
<td class="left">Years until the next official election</td>
<td class="left">World Bank</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Pham</p>
<p class="date">Created: 2016-02-15 Mon 04:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
